## Plan Result (543: prod_backendappgateway - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 1 to change, 5 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
* Delete
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-bookings-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-notification-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-test-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-user-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-video-api&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw"
        name                              = "aks00-prod-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/vh-bookings-api" -> null
          - ip_addresses = [
              - "10.144.15.250",
              - "10.144.31.250",
            ] -> null
          - name         = "vh-bookings-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/vh-notification-api" -> null
          - ip_addresses = [
              - "10.144.15.250",
              - "10.144.31.250",
            ] -> null
          - name         = "vh-notification-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/vh-test-api" -> null
          - ip_addresses = [
              - "10.144.15.250",
              - "10.144.31.250",
            ] -> null
          - name         = "vh-test-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/vh-user-api" -> null
          - ip_addresses = [
              - "10.144.15.250",
              - "10.144.31.250",
            ] -> null
          - name         = "vh-user-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/vh-video-api" -> null
          - ip_addresses = [
              - "10.144.15.250",
              - "10.144.31.250",
            ] -> null
          - name         = "vh-video-api" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/darts-api" -> null
          - name                                = "darts-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/darts-api" -> null
          - probe_name                          = "darts-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/darts-gateway" -> null
          - name                                = "darts-gateway" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/darts-gateway" -> null
          - probe_name                          = "darts-gateway" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/darts-proxy" -> null
          - name                                = "darts-proxy" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/darts-proxy" -> null
          - probe_name                          = "darts-proxy" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/gob-gateway" -> null
          - name                                = "gob-gateway" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/gob-gateway" -> null
          - probe_name                          = "gob-gateway" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 120 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/juror-api" -> null
          - name                                = "juror-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/juror-api" -> null
          - probe_name                          = "juror-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/juror-pnc" -> null
          - name                                = "juror-pnc" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/juror-pnc" -> null
          - probe_name                          = "juror-pnc" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/juror-scheduler-api" -> null
          - name                                = "juror-scheduler-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/juror-scheduler-api" -> null
          - probe_name                          = "juror-scheduler-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/juror-scheduler-execution" -> null
          - name                                = "juror-scheduler-execution" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/juror-scheduler-execution" -> null
          - probe_name                          = "juror-scheduler-execution" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/pip-account-management" -> null
          - name                                = "pip-account-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/pip-account-management" -> null
          - probe_name                          = "pip-account-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/pip-business-rules" -> null
          - name                                = "pip-business-rules" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/pip-business-rules" -> null
          - probe_name                          = "pip-business-rules" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/pip-channel-management" -> null
          - name                                = "pip-channel-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/pip-channel-management" -> null
          - probe_name                          = "pip-channel-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/pip-data-management" -> null
          - name                                = "pip-data-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/pip-data-management" -> null
          - probe_name                          = "pip-data-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/pip-publication-services" -> null
          - name                                = "pip-publication-services" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/pip-publication-services" -> null
          - probe_name                          = "pip-publication-services" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/pip-subscription-management" -> null
          - name                                = "pip-subscription-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/pip-subscription-management" -> null
          - probe_name                          = "pip-subscription-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/pre-api" -> null
          - name                                = "pre-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/probes/pre-api" -> null
          - probe_name                          = "pre-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ed attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/pip-subscription-management"
          + backend_address_pool_name  = "pip-subscription-management"
          + backend_http_settings_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/pip-subscription-management"
          + backend_http_settings_name = "pip-subscription-management"
          + http_listener_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/pip-subscription-management"
          + http_listener_name         = "pip-subscription-management"
          + id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/pip-subscription-management"
          + name                       = "pip-subscription-management"
          + priority                   = 60
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendAddressPools/toffee-recipe-backend"
          + backend_address_pool_name  = "toffee-recipe-backend"
          + backend_http_settings_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/backendHttpSettingsCollection/toffee-recipe-backend"
          + backend_http_settings_name = "toffee-recipe-backend"
          + http_listener_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/httpListeners/toffee-recipe-backend"
          + http_listener_name         = "toffee-recipe-backend"
          + id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/requestRoutingRules/toffee-recipe-backend"
          + name                       = "toffee-recipe-backend"
          + priority                   = 10
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "darts-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "darts-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "darts-api"
          + id                          = (known after apply)
          + name                        = "darts-api"
          + priority                    = 80
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "darts-gateway"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "darts-gateway"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "darts-gateway"
          + id                          = (known after apply)
          + name                        = "darts-gateway"
          + priority                    = 90
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "darts-proxy"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "darts-proxy"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "darts-proxy"
          + id                          = (known after apply)
          + name                        = "darts-proxy"
          + priority                    = 100
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "gob-gateway"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "gob-gateway"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "gob-gateway"
          + id                          = (known after apply)
          + name                        = "gob-gateway"
          + priority                    = 110
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-api"
          + id                          = (known after apply)
          + name                        = "juror-api"
          + priority                    = 170
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-pnc"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-pnc"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-pnc"
          + id                          = (known after apply)
          + name                        = "juror-pnc"
          + priority                    = 160
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-scheduler-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-scheduler-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-scheduler-api"
          + id                          = (known after apply)
          + name                        = "juror-scheduler-api"
          + priority                    = 140
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-scheduler-execution"
          +0m backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-scheduler-execution"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-scheduler-execution"
          + id                          = (known after apply)
          + name                        = "juror-scheduler-execution"
          + priority                    = 150
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pre-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pre-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pre-api"
          + id                          = (known after apply)
          + name                        = "pre-api"
          + priority                    = 130
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pre-portal"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pre-portal"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pre-portal"
          + id                          = (known after apply)
          + name                        = "pre-portal"
          + priority                    = 120
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ rewrite_rule_set {
            id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/vh-user-api"
          ~ name = "vh-user-api" -> "darts-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/vh-video-api"
          ~ name = "vh-video-api" -> "darts-gateway"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/vh-test-api"
          ~ name = "vh-test-api" -> "darts-proxy"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/vh-notification-api"
          ~ name = "vh-notification-api" -> "gob-gateway"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/vh-bookings-api"
          ~ name = "vh-bookings-api" -> "pre-portal"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/darts-api"
          ~ name = "darts-api" -> "pre-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/darts-gateway"
          ~ name = "darts-gateway" -> "juror-scheduler-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/darts-proxy"
          ~ name = "darts-proxy" -> "juror-scheduler-execution"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/gob-gateway"
          ~ name = "gob-gateway" -> "juror-pnc"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/pre-portal"
          ~ name = "pre-portal" -> "juror-api"
        }
      - rewrite_rule_set {
          - id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/pre-api" -> null
          - name = "pre-api" -> null
        }
      - rewrite_rule_set {
          - id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/juror-scheduler-api" -> null
          - name = "juror-scheduler-api" -> null
        }
      - rewrite_rule_set {
          - id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/juror-scheduler-execution" -> null
          - name = "juror-scheduler-execution" -> null
        }
      - rewrite_rule_set {
          - id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/juror-pnc" -> null
          - name = "juror-pnc" -> null
        }
      - rewrite_rule_set {
          - id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks00-prod-agw/rewriteRuleSets/juror-api" -> null
          - name = "juror-api" -> null
        }

      ~ ssl_policy {
          + min_protocol_version = "TLSv1_2"
            # (4 unchanged attributes hidden)
        }

        # (33 unchanged blocks hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-bookings-api"] will be destroyed
  # (because key ["vh-bookings-api"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "vh-bookings-api.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/platform.hmcts.net/A/vh-bookings-api" -> null
      - name                = "vh-bookings-api" -> null
      - records             = [
          - "10.144.32.136",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "platform.hmcts.net" -> null
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-notification-api"] will be destroyed
  # (because key ["vh-notification-api"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "vh-notification-api.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/platform.hmcts.net/A/vh-notification-api" -> null
      - name                = "vh-notification-api" -> null
      - records             = [
          - "10.144.32.136",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "platform.hmcts.net" -> null
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-test-api"] will be destroyed
  # (because key ["vh-test-api"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "vh-test-api.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/platform.hmcts.net/A/vh-test-api" -> null
      - name                = "vh-test-api" -> null
      - records             = [
          - "10.144.32.136",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "platform.hmcts.net" -> null
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-user-api"] will be destroyed
  # (because key ["vh-user-api"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "vh-user-api.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/platform.hmcts.net/A/vh-user-api" -> null
      - name                = "vh-user-api" -> null
      - records             = [
          - "10.144.32.136",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "platform.hmcts.net" -> null
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-video-api"] will be destroyed
  # (because key ["vh-video-api"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "vh-video-api.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/platform.hmcts.net/A/vh-video-api" -> null
      - name                = "vh-video-api" -> null
      - records             = [
          - "10.144.32.136",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "platform.hmcts.net" -> null
    }

Plan: 0 to add, 1 to change, 5 to destroy.
```

</details>





## :warning: Errors

* add a label 543: prod_backendappgateway - TerraformPlanApply/destroy: POST https://api.github.com/repos/hmcts/sds-azure-platform/issues/947/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":947,"Program":"tfcmt","SHA1":"","Target":"543: prod_backendappgateway - TerraformPlanApply","Vars":{}} -->